# operators
#    0    1  2   3   4   5   6   7   8
a = [11, 22, 33, 44, 55, 66, 77, 88, 99]
# b = [4, 5, 6]
# c = a + b
# c = a * 4
# del a[0]

#c = a
#c = a[:] == c = a.copy()

# c = a[8:0:]
# print(c)



#c = a[1::2] каждый четный элемент
#c = a[::]  шаг
# c = a[8:0:]  вернет пустой список
# Если неверные данные вводишьб вернет пустой список
# все, что ноль или отождествляется с нулем , то это false
#c = a[::-1] развернуть список
#a[3:] = [1, 2, 3]  --> [11, 22, 33, 1, 2, 3]


z, x, y = a[:3]  #распаковки
print(a)